Repository: catsmoker/0-A.D.-Arabic-Mode
Catalog: l10n/*.engine.po
Languages: ar

source: Long strings
ar: سلاسل نصية طويلة

source: unknown subtype (see logs)
ar: نوع فرعي غير معروف (انظر السجلات)

source: The certificate is not trusted.
ar: الشهادة غير موثوقة.

source: The certificate hasn't got a known issuer.
ar: الشهادة ليس لها جهة إصدار معروفة.

source: The certificate has been revoked.
ar: تم إلغاء الشهادة.

source: The certificate has expired.
ar: انتهت صلاحية الشهادة.

source: The certificate is not yet active.
ar: الشهادة ليست نشطة بعد.

source: The certificate has not been issued for the peer connected to.
ar: لم يتم إصدار الشهادة للطرف المتصل به.

source: The certificate signer is not a certificate authority.
ar: موقّع الشهادة ليس سلطة تصديق.

source: Error
ar: خطأ

source: No error
ar: لا يوجد خطأ

source: Player already logged in
ar: اللاعب مسجل دخوله بالفعل

source: Forbidden
ar: محظور

source: Internal server error
ar: خطأ داخلي في الخادم

source: Not allowed
ar: غير مسموح به

source: Not authorized
ar: غير مصرح به

source: Recipient temporarily unavailable
ar: المستلم غير متاح مؤقتًا

source: Registration required
ar: التسجيل مطلوب

source: Service unavailable
ar: الخدمة غير متاحة

source: Unknown error
ar: خطأ غير معروف

source: Stream error
ar: خطأ في البث

source: The incoming stream version is unsupported
ar: إصدار البث الوارد غير مدعوم

source: The stream has been closed by the server
ar: تم إغلاق البث من قبل الخادم

source: An I/O error occurred
ar: حدث خطأ في الإدخال/الإخراج

source: The connection was refused by the server
ar: تم رفض الاتصال من قبل الخادم

source: Resolving the server's hostname failed
ar: فشل في حل اسم مضيف الخادم

source: This system is out of memory
ar: نفدت ذاكرة هذا النظام

source: The server did not offer required TLS encryption
ar: لم يقدم الخادم تشفير TLS المطلوب

source: Authentication failed. Incorrect password or account does not exist
ar: فشلت المصادقة. كلمة المرور غير صحيحة أو الحساب غير موجود

source: The user or system requested a disconnect
ar: طلب المستخدم أو النظام قطع الاتصال

source: There is no active connection
ar: لا يوجد اتصال نشط

source: Your account has been successfully registered
ar: تم تسجيل حسابك بنجاح

source: Not all necessary information provided
ar: لم يتم تقديم جميع المعلومات الضرورية

source: Username already exists
ar: اسم المستخدم موجود بالفعل

source: Failure while starting querying for game id. Error: %s; %s.
ar: فشل أثناء بدء الاستعلام عن معرف اللعبة. الخطأ: %s; %s.

source: Failure while starting querying for mods. Error: %s; %s.
ar: فشل أثناء بدء الاستعلام عن التعديلات. الخطأ: %s; %s.

source: Could not create mod directory: %s.
ar: تعذر إنشاء دليل التعديل: %s.

source: Could not open temporary file for mod download: %s.
ar: تعذر فتح ملف مؤقت لتنزيل التعديل: %s.

source: Failed to start the download. Error: %s; %s.
ar: فشل في بدء التنزيل. الخطأ: %s; %s.

source: Asynchronous download failure: %s, %s.
ar: فشل التنزيل غير المتزامن: %s, %s.

source: Download failure. Server response: %s; %s.
ar: فشل التنزيل. استجابة الخادم: %s; %s.

source: Mismatched filesize.
ar: حجم الملف غير متطابق.

source: Invalid file. Expected md5 %s, got %s.
ar: ملف غير صالح. القيمة المتوقعة لـ md5 هي %s، تم استلام %s.

source: Failed to compute final hash.
ar: فشل في حساب التجزئة النهائية.

source: Failed to verify signature.
ar: فشل في التحقق من التوقيع.

source: custom build
ar: بناء مخصص

source: Screenshot written to '%s'
ar: تم حفظ لقطة الشاشة في '%s'
